#include <stdlib.h>
#include <stdio.h>
#include <math.h>

int main()
{
    double x, y;
//----------Оголошення дійсних змінних--------------
    printf("Enter x: ");
    scanf("%lf", &x);
//---------Розгалуження для заданих функцій з варіанту 13-----------
    if (x >= -3.0 && x < 3.0)
        y = 4.0 * sin(3.0 * x) + 3.0 * cos(4.0 * x);

    else if (x >= 10.0 && x < 20.0)
        y = 2.0 * pow(x, 2.0) - 5.0 * x + 9.0;

    else if (x >= 100.0 && x < 1000.0)
        y = log10(pow(x, 2.0)) - 3.0 * x;
        
    else
        y = -x / 10.0 + 1.0;
//-------Очищення екрану перед виведенням результатів обчислення---------
    system("cls");
//--------Виведення вхідного Х і вихідного У---------
    printf("x = %lf", x);
    printf("\ny = %lf\n", y);
//----------Кінець програми--------------------
    return 0;
}
